# top과 크기가 고정된 배열을 활용해서 스택을 구현해보자

# 스택 초기화
# 마지막에 삽입된 원소의 위치(인덱스)
top = -1

# 스택의 크기
N = 10

# 스택 만들기
s = [0] * N

# 스택에 자료 삽입하기
for i in range(1, N + 1):
    top += 1  # 삽입 전에 마지막 원소 위치 +1
    s[top] = i  # top 위치에 자료 삽입

print(s, top)
# 9가 나왔다는건, 더 이상 삽입 할 수 없다는 뜻

# 스택에서 자료 삭제
for i in range(10):
    print(s[top], end=",")
    top -= 1  # 삭제

print()

# 크기가 고정된 배열과 top을 통해서 스택을 구현한 경우
# 배열 안에 원소가 "진짜" 삭제되지 않는다
# 이렇게 구현하면 리스트를 보고 배열에 남아있다 비었다 판단하면 안 된다
# 이 때는 top을 보고 판단해야함 (-1이어야 빈거)
print(s, top)
