T = int(input())  # 테스트 케이스 받고

"""
쇠막대기는 자신보다 긴 쇠막대기 위에만 놓일 수 있다.
쇠막대기를 다른 쇠막대기 위에 놓는 경우 완전히 포함되도록 놓되, 
끝점은 겹치지 않도록 놓는다.
각 쇠막대기를 자르는 레이저는 적어도 하나 존재한다.
레이저는 어떤 쇠막대기의 양 끝점과도 겹치지 않는다.


(0)((((0)(0))((0))(0)))((0))
그니까 이렇게 바로 맞물리면 레이저가 된다는건가
스택문제인가 이거 
"""

for test_case in range(1, T + 1): # 테스트 케이스 돌면서
    pipes = input().strip()
    stack = [] # 스택으로 쓸 빈 배열
    total_pieces = 0 # 잘려진 쇳조각

    for i in range(len(pipes)): #문자열 받은거 좌아아악 돌면서
        if pipes[i] == '(': #일단 (이거 나오면 스택에 집어넣음 (새 막대기 시작 아니면 레이저 시작임)
            stack.append('(')  # 집어넣었쥬?
        else:
            stack.pop()  # ) 이거니까 바로 앞에꺼 끄집어내서 확인해바
            if pipes[i - 1] == '(':  # 바로 앞에 ( 이거면 레이저
                total_pieces += len(stack) # 그러면 지금 쌓여있던 스택 길이만큼 쇠파이프가 토막토막
            else:  # 잘린거 아니고 진짜 쇠파이프 끝인거임
                total_pieces += 1 # 그럼 한조각만 쁠라스

    print(f"#{test_case} {total_pieces}")
